// Напиши функцию sum, которая принимает два параметра и возвращает их сумму

// Вызови функцию с аргументами 1 и 2 и сохрани результат в переменную res1

// Выведи на экран содержимое переменной res1, объясни результат

// Вызови функцию с аргументами 3 и 5 и сохрани результат в переменную res2

// Выведи на экран содержимое переменной res2, объясни результат

// Вызови функцию с аргументами res1 и res2 и сохрани результат в переменную res3

// Выведи на экран содержимое переменной res3, объясни результат

// Вызови функцию без аргументов и сохрани результат в переменную res4

// Выведи на экран содержимое переменной res4, объясни результат

// Вызови функцию с аргументами true и 2, и сохрани результат в переменную res5

// Выведи на экран содержимое переменной res5, объясни результат
