// напиши функцию f1, которая возвращает число 42

// вызови функцию f1 и сохрани результат в переменную res1

// выведи на экран содержимое переменной res1, объясни результат

// посмотри работу на сайте https://pythontutor.com/visualize.html#mode=edit

// напиши функцию f2, которая возвращает сроку 'Hello'

// вызови функцию f2 и сохрани результат в переменную res2

// выведи на экран содержимое переменной res2, объясни результат

// напиши функцию f3, которая возвращает массив [1, 3, 5]

// вызови функцию f3 и сохрани результат в переменную res3

// выведи на экран содержимое переменной res3, объясни результат

// напиши функцию f4, которая возвращает объект { name: 'Joe' }

// вызови функцию f4 и сохрани результат в переменную res4

// выведи на экран содержимое переменной res4, объясни результат

// выведи на экран содержимое свойства res4.name, объясни результат

// напиши функцию f5, которая выводи в консоль 'Hello from f5' и ничего не возвращает

// вызови функцию f5 и сохрани результат в переменную res5

// выведи на экран содержимое переменной res5, объясни результат
