// напиши функцию echo, которая принимает один параметр с именем: value
// функция должна выводить в консоль значение параметра value

// напиши функцию f1, которая принимает два параметра с именами: num и callback
// функция должна вызывать параметр callback с аргументом num

// вызови функцию f1 с аргументами 42 и echo, объясни результат

// вызови функцию f1 с аргументами 'HELLO' и echo, объясни результат

// добавь в функцию f1 проверку: если параметр num НЕ число,
// тогда вывести сообщение 'Error: wrong argument' и выйти из функции
